namespace SsPvo.Client.Enums
{
    public enum SsPvoDocument
    {
        /// <summary> 
        /// документ, подтверждающий принадлежность к категории соотечественника 
        /// </summary>
        Compatriot,
        /// <summary> 
        /// бланк сочинения 
        /// </summary>
        Composition,
        /// <summary> 
        /// документ об образовании 
        /// </summary>
        Educations,
        /// <summary> 
        /// документ, подтверждающий инвалидность 
        /// </summary>
        Disability,
        /// <summary> 
        /// результаты ЕГЭ 
        /// </summary>
        Ege,
        /// <summary> 
        /// документ, подтверждающий принадлежность к категории граждан-военнослужащих 
        /// </summary>
        Militaries,
        /// <summary> 
        /// документ, подтверждающий результат олимпиады 
        /// </summary>
        Olympics,
        /// <summary> 
        /// документ, подтверждающий принадлежность к категории детей-сирот 
        /// </summary>
        Orphans,
        /// <summary> 
        /// другой документ 
        /// </summary>
        Other,
        /// <summary> 
        /// документ, определяющий принадлежность к категории граждан, родители и опекуны которых погибли при исполнении служебных обязанностей 
        /// </summary>
        ParentsLost,
        /// <summary> 
        /// документ, определяющий принадлежность к категории граждан, участвовавших в работах на радиационных объектах или подвергшихся воздействию радиации 
        /// </summary>
        RadiationWork,
        /// <summary> 
        /// документ, определяющий принадлежность к категории граждан, участвовавших в боевых действиях 
        /// </summary>
        Veteran,
    }
}
